Revit 2025 API
FabricHostReference Enumeration
 Controls if Single Fabric Sheet should be cut by the Host Cover.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricHostReference
Public Enumeration FabricHostReference
public enum class FabricHostReference
type FabricHostReference
Members
Member name | Value | Description
NotCutByCover | 0 |  The fabric is not cut by the host cover.
CutByCover | 1 |  The fabric is cut by the host cover.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace